<?php

$i = 2;
$j = 3;
if ($i > 3 || $i + $j > 4 && $j > 2) {
	echo "TRUE";
} else {
	echo "FALSE";
}

/**
 * Пояснення:
 *
 * Послідовність виконання виразу $i > 3 || $i + $j > 4 && $j > 2
 * - $i > 3 (2 > 3) (FALSE)
 * - $i + $j > 4 (2 + 3 > 4) (5 > 4) (TRUE)
 * - $j > 2 (3 > 2) (TRUE)
 *
 * Після обчислень вираз буде вигялати так:
 * FALSE || TRUE && TRUE
 *
 * Через різні пріорітети логічних операторів спочатку виконаеться TRUE && TRUE (TRUE).
 *
 * Потім: FALSE || TRUE (TRUE)
 *
 * Скрипт виведе: TRUE
 */